#include "generate.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#include "id.h"
#include "snowflake.h"

char* DoctorPath = "../data/doctor.csv";
char* PersonPath = "../data/person.csv";
char* VaccinePath = "../data/vaccine.csv";
char* RecordPath = "../data/record.csv";

int doctor_num = 0;   // 医生数量
int person_num = 0;   // 接种者数量
int vaccine_num = 0;  // 疫苗数量
int record_num = 0;   // 接种信息数量

char hospital_list[HospitalNum][100] = {
    "重庆儿童医院(重庆医科大学附属儿童医院)",
    "重庆新桥医院",
    "中国人民解放军三二四医院",
    "武警重庆总队医院",
    "重庆三峡中心医院",
    "重庆市红十字会医院",
    "重庆市涪陵中心医院",
    "重庆市第九人民医院",
    "重庆市急救医疗中心",
    "重庆市肿瘤医院",
    "重庆医科大学附属口腔医院",
    "重庆医科大学附属第二医院",
    "重庆医科大学附属永川医院",
    "重庆医科大学附属儿童医院禮嘉分校",
};

char person_list[PersonNum][20] = {
    "艾陈芳", "王特",   "杨坤",   "李蕾",   "韩苏闽", "赵惠麟", "王锦麒",
    "朱康英", "江亚英", "赵希久", "吴慧新", "张星",   "姜明燊", "郑建芳",
    "肖勉",   "陆可人", "李世昌", "周志红", "许翥中", "张蔼玲", "林坚",
    "朱继澄", "沈杰",   "林循泓", "宋启根", "邓其萱", "樊发兴", "丁红朝",
    "马春宇", "尹明柴", "付荣华", "冯克江", "朱艳峰", "刘科江", "齐攀",
    "买琳燕", "杨震伦", "吴隽",   "张勇",   "陆明祥", "陈基纯", "陈惠红",
    "陈湘平", "赵聚雪", "胡耀民", "段娜",   "侯文峰", "徐梦漪", "高鹏",
    "盛永华", "童丽",   "曾卉",   "曾衍文", "詹增荣", "蔡柳萍", "蔡小路",
    "曹继娟", "曾令权", "陈海山", "陈秀梅", "陈宜国", "谌丹",   "程钰淇",
    "程院莲", "仇授书", "代慧",   "邓白君", "邓永平", "翟丽娜", "丁玉红",
    "窦艳",   "杜素音", "高燕",   "关霓",   "郭红霞", "郭连红", "郭全美",
    "郝丽萍", "何华",   "黄琛",   "黄洁琦", "黄丽丽", "黄美灵", "黄映雪",
    "黄有福", "黄泽文", "金莉莉", "金迎迎", "孔巧丽", "李常能", "李海欢",
    "李霞",   "李晓跃", "李燕霞", "李子莹", "梁文晓", "林祖乐", "刘鲲",
    "刘希",   "刘云",   "罗书嵘", "莫裕醒", "欧越男", "潘瑾",   "裴小妮",
    "秦铭谦", "任碧峰", "任岩岩", "石慧",   "石先兵", "汪雯波", "王超辉",
    "王珏",   "王蕾蕾", "王丽娜", "王书玮", "魏爱敏", "谢艳霜", "玄颖双",
    "闫黎",   "杨井兰", "杨柳",   "杨宪福", "杨智翼", "张春霞", "张莉萍",
    "张雯",   "张雨红", "张占辉", "赵佳",   "钟闰禄", "钟晓玲", "丁镇裕",
    "万绮思", "卫婵",   "王雪",   "王鹏",   "尹诗雨", "吕润玲", "刘文惠",
    "刘亚楠", "刘强",   "孙晓龙", "孙道明", "纪丽芝", "杜满聪", "李海楠",
    "杨立军", "杨秀",   "杨金玲", "杨秋苑", "杨璐",   "吴晓亚", "吴镇宣",
    "邱华愉", "邱晨瑜", "何玮",   "何嘉鸿", "余一鸣", "张云茜", "张圣翎",
    "张倩",   "张雅楠", "林惠媛", "罗文升", "罗梦",   "罗锦雯", "庞伟涛",
    "赵国栋", "赵惟琦", "钟晓天", "段琪",   "高一晓", "高圆珊", "陶丽萍",
    "黄日财", "黄苏苏", "黄洁",   "营鑫妍", "梁炬强", "彭姗",   "谢澌祺",
    "曹淑敏", "曹志勇", "常春兰", "崔红宇", "崔敬伟", "戴蕾",   "邓博涛",
    "邓莉",   "杜建章", "杜荣基", "段青",   "范艳",   "冯春恒", "冯红",
    "高巍",   "高占海", "顾红丽", "郭建立", "郭卫东", "郭晓东", "韩梅",
    "韩云庆", "郝连水", "侯献英", "贾隽仙", "贾淑敏", "贾燕青", "蒋胜利",
    "靖凤琴", "李百春", "李丹",   "李会英", "李健",   "李柯瑶", "李磊",
    "李丽萍", "李尚",   "李淑媛", "李艳萍", "李迎春", "李子坤", "刘二光",
    "刘净微", "刘娟",   "刘鹏",   "刘秋莲", "刘然欣", "刘少斌", "刘树江",
    "刘伟旺", "刘艳玲", "刘艳茹", "刘艳薇", "刘振杰", "路连军", "鲁全福",
    "吕金起", "马福平", "马恒卫", "马莉",   "马龙",   "马燕飞", "任晋葆",
    "任世奎", "申建军", "石海斌", "史海志", "陈思诺", "陈思思", "陈穗群",
    "陈天灵", "陈婷婷", "陈彤",   "陈统",   "陈通",   "陈图凤", "陈歪嘴",
    "陈琬倩", "陈伟",   "陈伟华", "陈维琳", "陈伟廷", "陈玟皑", "陈雯东",
    "陈文俊", "陈文卿", "陈文雪", "陈雯玉", "晨唏",   "陈曦",   "陈希宁",
    "陈鲜孰", "陈鲜毅", "陈香裕", "陈晓",   "陈晓晨", "陈潇含", "陈晓杰",
    "陈小林", "陈筱路", "陈晓萌", "陈小敏", "陈孝厦", "陈晓肖", "陈鑫",
    "陈新春", "陈灵伟", "陈聆子", "陈璐琦", "陈路爽", "陈眉灵", "陈猛",
    "陈蜜蜜", "陈缅芙", "陈妙宙", "陈泯西", "陈明",   "陈明彩", "陈明榕",
    "陈薏芝", "陈茵斓", "朱新峰", "朱兴恒", "朱絮菲", "朱轩轩", "祝亚丽",
    "陈志强", "陈之万", "陈志远", "陈庄灏", "陈子琳", "陈姿言", "陈紫芸",
    "陈总",   "陈宗才", "陈宗强", "陈作中", "程傍纯", "成玻枚", "成不忧",
    "程晨",   "程澄",   "程琤",   "成澄靖", "程淳环", "程冻",   "成尔秩",
    "成发芷", "程放",   "程方昱", "程飞",   "程枫",   "澄观",   "成贯征",
    "澄光",   "成河灿", "成璜",   "程佳楠", "程驹",   "程凯雪", "程乐乐",
    "程厉卫", "程灵素", "程明月", "成品彤", "程茜",   "程芹荷", "程青霜",
    "程青竹", "成蕊蓉", "程三",   "程森鹏", "程少华", "澄识",   "程愫",
    "程坛主", "成天骄", "澄通",   "程维藩", "程文斌", "程文馨", "程响",
    "程向美", "成笑笑", "澄心",   "程新森", "程亚梅", "程瑶迦", "程毅欢",
    "程艺辉", "程一璇", "程瑛",   "程玉霞", "成昀澄", "程志强", "成自学",
    "迟百诚", "池冰龄", "池波",   "迟春道", "池赋祈", "褚惇三", "褚浮棋",
    "褚轰",   "褚红柏", "褚建刚", "褚恋馨", "褚列桦", "楚留香", "褚隆鲜",
    "楚青",   "褚仕超", "褚太赣", "褚万春", "褚万里", "初夏",   "楚相羽",
    "楚湘云", "褚学蓝", "褚裔喜", "褚溢稚", "褚郁安", "崔恩生", "崔方颖",
    "崔公德", "崔海清", "崔汉梁", "崔吉凤", "崔佳",   "朱强",   "朱青",
    "朱秋燕", "朱蓉",   "朱荣应", "朱儒",   "朱世强", "朱同辉", "朱文超",
    "朱文杰", "朱文静", "朱文龙", "朱文婷", "朱祥璋", "祝晓菲", "程遥迦",
    "禇娜",   "祝术吉", "朱书秀", "朱铁",   "朱晓建", "朱效强", "朱晓欣",
    "朱亚文", "朱彦慧", "朱嫣英", "朱一龙", "朱一名", "祝莹莹", "朱永博",
    "朱永利", "朱宇",   "朱玉彬", "朱玉贵", "朱玉含", "朱玉林", "朱玉龙",
    "朱媛",   "朱元静", "朱媛媛", "朱元璋", "朱媛珍", "朱云",   "朱照辰",
    "朱兆宏", "朱肇巧", "朱振涵", "朱正浩", "朱之华", "朱志将", "朱胄卫",
    "朱子柳", "朱字龙", "朱子明", "朱梓骁", "朱祖荫", "朱作超", "庄步川",
    "庄春雨", "庄当甜", "庄蝶茜", "庄涪方", "庄贵萌", "庄桦咏", "庄晋荷",
    "庄敏",   "庄妮",   "庄盼利", "庄乾香", "庄容",   "庄榕玄", "庄淑婷",
    "庄廷龙", "庄挺洲", "庄文翠", "庄文帅", "庄侠绍", "庄湘心", "庄晓辉",
    "庄新新", "庄心妍", "庒学丙", "庄雪昕", "庄彦",   "庄月梅", "庄允城",
    "庄铮",   "庄征菁", "庄灼葛", "卓碧君", "卓冰冰", "卓不凡", "卓尘映",
    "卓互知", "卓楼泰", "卓侨汉", "卓帅",   "卓天雄", "卓文萱", "卓纹琰",
    "卓先生", "卓纤愿", "卓依婷", "卓瑛蓉", "卓兆滕", "子聪",   "紫翠",
    "紫寒",   "紫君",   "紫蓝",   "紫髯龙", "紫山",   "梓旭",   "紫衣侯",
    "宗成海", "宗建明", "宗明",   "宗润钧", "宗伟玲", "宗维侠", "宗贤华",
    "宗先润", "宗雄",   "宗有海", "邹包幼", "邹尝淑", "邹得森", "邹度承",
    "邹飞维", "邹固海", "邹浩云", "邹荷革", "邹季民", "邹家成", "邹康",
    "邹丽莹", "邹俩珍", "邹南金", "邹佩棠", "邹蜀琅", "邹树园", "邹稳山",
    "祖大寿", "祖海",   "祖千秋", "俎志鹏", "左公龙", "左广念", "左佳",
    "左可欣", "左冷禅", "左明珠", "左轻侯", "左升",   "左学财", "左又铮",
    "左子穆", "陈亦骏", "付鹏宇", "倪筹帷", "沈希特", "赵晨雪", "晁静",
    "李俊发", "刘毅",   "卢燊",   "覃小玲", "曲伟玮", "饶江",   "任红岩",
    "沈华",   "舒眉",   "宋畅",   "孙信",   "汤怡君", "屠轶凡", "王程",
    "何葛明", "贾成",   "贾小玲", "韦笑",   "徐红艳", "薛峰",   "杨阿开",
    "杨开悦", "张永",   "周桂仙", "周雷雨", "周晓雨", "朱振杰", "蔡建红",
    "左书僮", "左小青", "胡晓菲", "胡晓洁", "胡晓雯", "岳妖男", "岳姚楠",
    "岳耀南", "岳耀楠", "宁吉超", "宁吉翔", "张焕娟", "张作森", "李爱菊",
    "李汉东", "李可淼", "李玉福", "李玉歧", "曾楚涵", "陈立言", "陈逸豪",
    "杜星仪", "付鸿杰", "甘奉龙", "曹培云", "何东宸", "胡浩楠", "黄奕聪",
    "黄彧嘉", "江雨轩", "雷馨怡", "李杜宸", "梁曦月", "刘栩源", "刘沅睿",
    "龙思言", "罗湃镝", "罗文煜", "罗云熙", "彭淩苇", "权益",   "绕欣霈",
    "汤子墨", "万子淇", "王凌越", "王梦晗", "吴文瀚", "武芋君", "吴雨昕",
    "宁焕新", "鲁盫琪", "谢澄泓", "徐杨",   "杨佳",   "易致芯", "余姿霓",
    "张天琪", "张芷涵", "赵晨樨", "周昱辰", "刘佳",   "孙亚萍", "姜涛",
    "赵思蕊", "解茹姗", "王小丹", "赵凌洁", "陈振和", "薛国亚", "佘颖禾",
    "刘振田", "单炳梓", "杨汉国", "唐九如", "吕培贞", "方先和", "姚梓华",
    "陶光华", "马裕音", "冯秀娟", "张平",   "童启明", "黄安永", "张淑芳",
    "王功勋", "肖士者", "陈营",   "陈颖鑫", "陈永超", "陈咏梅", "陈永顺",
    "陈永田", "陈游斗", "陈友谅", "陈悠悠", "陈禹",   "陈宇博", "陈玉堃",
    "陈原庚", "陈圆圆", "陈媛媛", "陈云鹏", "陈蕴艺", "陈占刚", "陈展鹏",
    "陈兆曼", "陈招戚", "陈振峰", "陈臻江", "陈正德", "陈铮芙", "陈志浩",
    "陈治华", "陈志朋", "陈鑫钱", "陈幸威", "陈秀秀", "陈旭",   "陈玄风",
    "陈雪琰", "陈迅秀", "陈雅妮", "陈燕",   "陈艳冰", "陈彦妃", "陈言桦",
    "陈琰汇", "陈琰俊", "陈彦霖", "陈艳璐", "陈延名", "陈妍希", "陈彦旭",
    "陈阳圣", "陈瑶",   "陈毅",   "陈毅迟", "陈亦菲", "陈裔丰", "陈意涵",
    "陈怡名", "陈裔千", "陈义群", "陈怡蓉", "辰亦儒", "陈依桐", "陈奕同",
    "陈伊轩", "陈艺祯", "宋改花", "宋玉",   "孙宝文", "谭二喜", "田来旺",
    "田永永", "王宝爱", "王东明", "王建军", "王建平", "王连根", "王群",
    "王仁贵", "王相平", "王晓东", "王小平", "王延明", "王月琴", "王泽平",
    "魏海光", "温晓辉", "武久清", "武生丰", "武生鹏", "武树华", "武四宝",
    "吴伟勇", "武永耀", "武振华", "武周记", "肖学光", "徐恩平", "许忠民",
    "薛凤芝", "薛建军", "薛明亮", "薛勇",   "杨海利", "杨俊平", "杨瑞明",
    "杨润香", "杨三平", "叶冬平", "于树礼", "岳新林", "岳忠孝", "翟敏",
    "张安辉", "张宝珍", "张春泉", "张大玉", "张东柱", "张二宝", "张福明",
    "张国新", "张海亮", "张贺英", "张宏海", "张虎",   "张建飞", "张金龙",
    "张景贵", "张康亮", "陈康睿", "陈珂",   "陈科宏", "陈可欣", "陈铿鹤",
    "陈来子", "陈丽",   "陈丽娜", "陈良田", "陈林",   "陈倩",   "陈虔荷",
    "陈倩如", "陈谦歆", "陈乔恩", "陈清华", "陈秋宇", "陈佺",   "陈群莺",
    "陈仁华", "陈镕凉", "陈榕怡", "陈儒鹊", "陈瑞",   "陈瑞琨", "陈蕊筌",
    "陈瑞莹", "陈若仪", "陈绍翀", "陈沈策", "陈诗牧", "陈世万", "陈寿胜",
    "陈守涛", "陈守学", "陈数",   "陈书杰", "陈书婉", "陈书胄", "马莹",
    "门江涛", "穆增志", "彭艳惠", "乔豫",   "申继忠", "申青青", "石娜",
    "宋爱梅", "苏春龙", "孙静",   "孙娟",   "谭红莲", "田颖",   "王春红",
    "王德林", "王峰",   "王集合", "王林红", "王素娟", "王巍",   "王卫国",
    "王岩红", "王银祥", "王煜",   "王玉红", "王玉英", "王振山", "王志芳",
    "魏春利", "魏红梅", "谢志威", "许艳丽", "闫来胜", "闫智胜", "闫宗清",
    "杨保江", "杨蓓",   "杨华丽", "杨金柱", "杨晓丽", "杨英才", "杨玉良",
    "要红月", "于光",   "于谦",   "袁锐坚", "袁雪雯", "张策",   "张冲",
    "张冬梅", "张国栋", "张和平", "张辉",   "张建学", "张晶",   "张静",
    "张丽",   "张琳",   "张玲",   "陳敏",   "陳培琨", "陳舒鵬", "韩春肖",

};

char doctor_list[DoctorNum][20] = {
    "何剛",   "洪冰冰", "洪銘斌", "洪琪磷", "洪茜雅", "焦雪",   "孔令硕",
    "賴贈存", "蘭心梅", "李佳星", "邱文星", "施乾隆", "施强取", "施少亦",
    "施曉琪", "施增意", "王斌雅", "王苗苗", "王詩婷", "王豔豔", "吴嘉益",
    "吴文漪", "吴雅詩", "吴英彪", "吴英娜", "吴振閩", "許達津", "許燕琴",
    "許珍妮", "楊嘉習", "余琼燕", "袁粵",   "張曉莎", "周志源", "黄良月",
    "黄文霖", "吴汉",   "修阳",   "薛学亮", "刘雅琪", "王俊",   "王瑞芳",
    "吴学峰", "赵凤伟", "安二兵", "鲍树宝", "曹保福", "曹建伟", "曹文平",
    "陈金贵", "陈利清", "陈明珠", "陈永红", "成改平", "崔平平", "崔小胜",
    "党彦斌", "邓文凯", "董锁红", "董文灵", "董云军", "董云启", "杜燕平",
    "樊明珠", "高爱星", "高保明", "高长青", "高长元", "高根连", "高虎照",
    "高建文", "高锦宏", "高军",   "高文国", "葛祥明", "耿晓平", "巩建柱",
    "郭爱珍", "郭成武", "郭光明", "郭继昌", "郭七日", "郭荣",   "郭五日",
    "郭永兵", "韩铁锁", "郝国平", "郝明生", "郝志强", "贺福才", "何先兆",
    "侯宝明", "侯恩伟", "侯建光", "侯文军", "胡根生", "胡胜平", "胡晓东",
    "胡晓晋", "黄卫峰", "霍文平", "贾恒利", "康奋明", "李宝增", "李福生",
    "李国胜", "李红才", "李建军", "李金生", "李俊林", "李俊生", "李美生",
    "李庆",   "李秀龙", "李玉彬", "李渊文", "李月峰", "李增玉", "李祖宽",
    "廉建明", "梁大宝", "梁二宝", "梁冯五", "梁明玉", "梁三宝", "申继忠",
    "申青青", "石娜",   "宋爱梅", "苏春龙", "孙静",   "孙娟",   "谭红莲",
    "田颖",   "王春红", "王德林", "王峰",   "王集合", "王林红", "王素娟",
    "王巍",   "王卫国", "王岩红", "王银祥", "王煜",   "王玉红", "王玉英",
    "王振山", "王志芳", "魏春利", "魏红梅", "谢志威", "许艳丽", "闫来胜",
    "闫智胜", "闫宗清", "左子穆", "陈亦骏", "付鹏宇", "倪筹帷", "沈希特",
    "赵晨雪", "晁静",   "李俊发", "刘毅",   "卢燊",   "覃小玲", "曲伟玮",
    "饶江",   "任红岩", "沈华",   "舒眉",   "宋畅",   "孙信",   "汤怡君",
    "屠轶凡", "王程",   "何葛明", "贾成",   "贾小玲", "韦笑",   "徐红艳",
    "薛峰",   "杨阿开", "杨开悦", "张永",   "周桂仙", "周雷雨", "周晓雨",
    "朱振杰", "蔡建红", "左书僮", "左小青", "胡晓菲", "胡晓洁", "胡晓雯",
    "岳妖男", "岳姚楠", "闫黎",   "杨井兰", "杨柳",   "杨宪福", "杨智翼",
    "张春霞", "张莉萍", "张雯",   "张雨红", "张占辉", "赵佳",   "钟闰禄",
    "钟晓玲", "丁镇裕", "万绮思", "卫婵",   "王雪",   "王鹏",   "尹诗雨",
    "吕润玲", "刘文惠", "刘亚楠", "刘强",   "孙晓龙", "孙道明", "纪丽芝",
    "杜满聪", "李海楠", "杨立军", "杨秀",   "杨金玲", "杨秋苑", "杨璐",
    "吴晓亚", "吴镇宣", "邱华愉", "邱晨瑜", "何玮",   "何嘉鸿", "余一鸣",
    "张云茜", "张圣翎", "张倩",   "张雅楠", "林惠媛", "罗文升", "罗梦",
    "罗锦雯", "庞伟涛", "赵国栋", "赵惟琦", "钟晓天", "段琪",   "高一晓",
    "高圆珊", "陶丽萍", "黄日财", "黄苏苏", "黄洁",   "营鑫妍", "梁炬强",
    "彭姗",   "谢澌祺",
};

// 疫苗信息
char vaccine_type[VACCINENUM][30] = {
    "北京生物新冠疫苗", "科兴中维新冠疫苗", "武汉生物新冠疫苗",
    "康希诺新冠疫苗",   "智飞新冠疫苗",     "康泰新冠疫苗",
    "医科生物新冠疫苗",
};

// 医生数据生成
int DoctorDataGenerate() {
  FILE* fp;
  // 打开数据文件
  if ((fp = fopen(DoctorPath, "w")) == NULL) {
    printf("打开文件%s错误\n", DoctorPath);
    return -1;
  }
  fprintf(fp, "id,name,hospital\n");  // 写入第一行（标题）的内容
  for (int i = 0; i < DoctorNum; ++i) {
    doctors[doctor_num].id = next_id();
    strcpy(doctors[doctor_num].name, doctor_list[doctor_num]);
    strcpy(doctors[doctor_num].hospital, hospital_list[rand() % HospitalNum]);
    fprintf(fp, "%lld,%s,%s\n", doctors[doctor_num].id,
            doctors[doctor_num].name, doctors[doctor_num].hospital);
    doctor_num++;
  }  // 逐行获取结构体内容
  fclose(fp);
  return 0;
}

// 接种者数据生成
int PersonDataGenerate() {
  FILE* fp;
  // 打开数据文件
  if ((fp = fopen(PersonPath, "w")) == NULL) {
    printf("打开文件%s错误\n", PersonPath);
    return -1;
  }
  fprintf(fp, "id,name,phone\n");  // 写入第一行（标题）的内容
  for (int i = 0; i < PersonNum; ++i) {
    RandomId(id, i);
    strcpy(persons[person_num].id, id);
    strcpy(persons[person_num].name, person_list[rand() % PersonNum]);
    persons[person_num].phone =
        1e10 + (rand() % 10 + 30) * 1e8 + rand() % (int)1e8;
    fprintf(fp, "%s,%s,%lld\n", persons[person_num].id,
            persons[person_num].name, persons[person_num].phone);
    person_num++;
  }  // 逐行获取结构体内容
  fclose(fp);
  return 0;
}

// 疫苗数据生成
int VaccineDataGenerate() {
  FILE* fp;
  // 打开数据文件
  if ((fp = fopen(VaccinePath, "w")) == NULL) {
    printf("打开文件%s错误\n", VaccinePath);
    return -1;
  }
  fprintf(fp, "id,type,\n");  // 写入第一行（标题）的内容
  for (int i = 0; i < VaccineNum; ++i) {
    vaccines[vaccine_num].id = next_id();
    vaccines[vaccine_num].type = rand() % VACCINENUM;
    fprintf(fp, "%lld,%d\n", vaccines[vaccine_num].id,
            vaccines[vaccine_num].type);
    vaccine_num++;
  }  // 逐行获取结构体内容
  fclose(fp);
  return 0;
}

// 接种记录生成
int RecordDataGenerate() {
  FILE* fp;
  // 打开数据文件
  if ((fp = fopen(RecordPath, "w")) == NULL) {
    printf("打开文件%s错误\n", RecordPath);
    return -1;
  }
  fprintf(fp, "id,person_id,doctor_id,vaccine_id,year,month,day\n");
  for (int i = 0; i < VaccineNum; ++i) {
    records[record_num].id = next_id();
    strcpy(records[record_num].person_id, persons[rand() % PersonNum].id);
    records[record_num].doctor_id = doctors[rand() % DoctorNum].id;
    records[record_num].vaccine_id = vaccines[rand() % VaccineNum].id;
    // 考虑到现实中疫苗在2021年开始大规模注射
    // 而截至程序编写时为2022年7月，故如此分类
    int year = rand() % 2;
    if (year == 0) {
      records[record_num].year = 2021;
      records[record_num].month = 1 + rand() % 11;
    } else {
      records[record_num].year = 2022;
      records[record_num].month = 1 + rand() % 7;
    }
    records[record_num].day = 1 + rand() % 27;
    fprintf(fp, "%lld,%s,%lld,%lld,%d,%d,%d\n", records[record_num].id,
            records[record_num].person_id, records[record_num].doctor_id,
            records[record_num].vaccine_id, records[record_num].year,
            records[record_num].month, records[record_num].day);
    record_num++;
  }  // 逐行获取结构体内容
  fclose(fp);
  return 0;
}